Revit 2027 API
VertexPositionColored Constructor
 Constructs the vertex from a point and a color.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VertexPositionColored(
	XYZ position,
	ColorWithTransparency color
)
Public Sub New (
	position As XYZ,
	color As ColorWithTransparency
)
public:
VertexPositionColored(
	XYZ^ position,
	ColorWithTransparency^ color
)
new :
        position : XYZ *
        color : ColorWithTransparency -> VertexPositionColored
Parameters
position XYZ
 The vertex's position.
color ColorWithTransparency
 The vertex's color.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
VertexPositionColored Class
Autodesk.Revit.DB.DirectContext3D Namespace